Revit 2024 API
BuiltInFailures.CurtainWallFailures Class
 Failures about CurtainWall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class CurtainWallFailures
Visual Basic
Public NotInheritable Class CurtainWallFailures
Visual C++
public ref class CurtainWallFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures
See Also
BuiltInFailures.CurtainWallFailures Members
Autodesk.Revit.DB Namespace